{"uin_no": "ICIPAGP18102V011718", "policy_no": "41 48 / 208 97 4939/00 ", "policyholder_name": "PRASANTH KUMAR REDDY ALLAMPATI", "dob": "20 , or_1991", "insured_person_aadhar_no": "6967 4474 9226", "relationship_of_claimant_with_insured_person": "SELF", "address_for_communication": "A-PRASANTH KUMAR REDDY , 32/1-32-1 NAVARAYA SCHOOL AREA , ATMAKUR , NELLORE DIST", "claiment_contact_no": "2441922660 _/ Res. No.", "claiment_email_id": "Prasanth . all@gmail.com", "claimant_aadhar_no": "96744747226", "claim_no": "BA FO43616287", "hospital_name": "ABHIRAM INSTITUTE OF MEDICAL SCIENCES", "hospital_address": "ATMAKUR , SPSR NELLORE DisT, AP-5241312", "treating_medical_practitioner": "DR. KC. V. SRAVAN KUMAR", "nature_of_injury/illness": "Acute febrile elkinerss with thembayto Penia with Pengue positive", "particulars_of_treatment": "fever with weeknices associates will Bveneto ill on the bo-ha tendue on the abdomain Rosina", "admission_date_time": "83/ 1\\ / 20 20 Time#?SoAM/AM", "discharge_date_time": "30 / (1/_202 0 Time4 30 AM/PM", "claimant/insured_person's_name(as_per_bank_records": "ALLAMPATI PRASANTH KUMAR REDDY ", "claimant/insured_person's_bank_account_no": "10003591948", "name_of_the_bank": "IDFC BANK", "branch_name:": "RESEPency Road - Bangalore", "bank_address": "RESIDENCY BUILDING BANGALORE - 260085", "IFSC_code": "IDEDoo Scal _(should be same as per the provided cheque leaflet) *Nominee's bank account details are required in case of a death claim. Terms and Conditions for payments through RTGS/NEFT 1. The details provided by the claimant / Insured Person in the Mandate Form provided by us shall be considered as final and ICICI Lombard General Insurance Company Lid. shall not be responsible for cross verification of any of the details provided therein. 2. The RTGS/ NEFT facility shall be effective for the respective claimant / Insured Person within 15 days of the receipt of the Mandate Form by ICICI Lombard General Insurance Company Lid. and/ or within such period as may be reasonably required by ICICI Lombard General Insurance Company Lid. to activate the RTGS/ NEFT facility. 3. The claimant / Insured Person agrees that under the RTGS/ NEFT facility, there may be a risk of non- payment in the claimant / Insured Person bank account on the day of the credit of payments due to change in the applicable regulations pertaining to RTGS/ NEFT facility or due to any other reasons without any fault/ inaction/ failure on part of ICICI Lombard General Insurance Company or any factor beyond the control of ICICI Lombard General Insurance Company Limited. 4. The claimant / Insured Person agrees to indemnify, without delay or demur, ICICI Lombard General Insurance Company Lid. and its agents and keep ICICI Lombard General Insurance Company Lid. and its agent indemnified harmless at all times from and against any and all claims, damages, losses, costs, and expenses (including attorney's fees) which ICICI Lombard General Insurance Company Lid. may suffer or incur, directly or indirectly. arising from or in connection with, amongst other things, either of the aforesaid reasons stated in above clauses. 5. ICICI Lombard General Insurance Company Lid. may sub-contract and employ agents to carry out any of its obligations under the RTGS/ NEFT facility. The claimant/ Insured Person may discontinue or terminate the use of RTGS/ NEFT facility by giving a minimum of 15 days prior written notice to ICICI Lombard General Insurance Company Lid. The notice of, such termination should be given to ICICI Lombard General Insurance Company Lid. only at its corporate address and be addressed at \"ICICI Lombard GIC Ltd., ICICI Lombard House (Old Tata Press Building). 414. Veer Savarkar Marg. Near Siddhi Vinayak Temple. Prabhadevi, Mumbai - 400025.- 6. A confirmation of the receipt of termination notice given by the claimant/ Insured Person will be acknowledged through a confirmation letter by ICICI Lombard General Insurance Company Lid. In no case can the claimant/ Insured Person construe his termination notice as effective unless a confirmation has been provided by ICICI Lombard General Insurance Company Lid. to the claimant/ Insured Person stating the date of receipt of such communication by the claimant/ Insured Person. 7. The claimant/ Insured Person agrees that transaction(s) through RTGS/ NEFT facility may attract inward RTGS/ NEFT charges, which if levied by the claimant/ Insured Person's bank, shall be borne by the claimant/ Insured Person only 8. ICICI Lombard General Insurance Company Lid. has the absolute discretion to amend or supplement any Terms and Conditions stated herein at any time and will endeavour to give prior notice of ten days for such changes wherever feasible for the Terms and Conditions to be applicable. By using the new services, or at the completion of such period, whichever is earlier, the claimant/ Insured Person shall be deemed to have accepted the changed Terms and Conditions. 9. Submission of documents or bank details or any other information does not in any way, shape or form, imply or express or suggest admission of liability by ICICI Lombard General Insurance Company Lid. 10. Notices under these Terms and Conditions may be given in writing by delivering them by hand, or e-mail, or displaying them on ICICI Lombard General Insurance Company Lid. Website \"www.icicilombard.com\". or by sending them by post to the last address of the claimant/ Insured Person.", "Place": "Atmalar", "Date": "20- 12- 2020", "kyc_contact_no": "", "Name of the Insured Person/claimant/Nominee": "PRASANTH KUMAR REDPX ALLAMPATI", "Relation with the Insured Person": "SELE"}